在软件开发之前，短信服务，服务器，文件服务，CDN等服务可以先准备起来了，还要注册一个域名，进行备案等操作，还要注册申请支付宝账号，签约支付功能，微信支付，分享功能的申请签约，统计功能的申请签约，前期准备工作也是比较多的。


一、App主要功能

Tabbar主要包括4块：首页、广场、消息、我

1、首页：
    Banner，作为应用内广告位,banner点击进去是相应的h5页面，或者是应用内页面
    相册主分类展示，比如：毕业季、生日、旅行等，分类点击进去之后，是相应分类下的模板列表，模本列表点击进去之后便可以查看整个模板布局，用户可以在下方点击制作从相册来选择手机内的图片。
    制作相册过程中，可以对照片位置，大小，以及色调进行简单编辑。
    用户自行制作好相册后，保存即可在“我”里面查看到相册列表。
    用户可以选择相应的相册分享到微信，微博，手Q
    用户制作完成之后，可以直接下单

    *模板列表需要做到无需更新版本，即可随时更新*

2、广场
    这个是待定的版块，初衷是为了可以增加一定的社交功能，提升用户活跃度
    广场里面可以看到其他用户公开出来的最新的相册
    用户可以对自己和他人的相册进行评论，交流，甚至可以加好友关注
    右上角有一个按钮，表示我也要制作，即当用户看到他人制作的相册之后，可以在本页面直接进入相册模板选择页面，进行相册制作

3、消息
    这个页面可以放系统消息，和一些推广推送消息
    系统消息，比如订单状态有变更，或者有人@自己
    推广消息，比如，有什么新的活动，后台需要直接推送给客户端的，手机震动，消息图标上数字标签加1等

4、我
    *自定义模板上传*
    这里主要是用户的个人页面，可以查看相册，订单，优惠券等等
    这里的相册，可以点击进去进行下单
    设置物流地址
    变更手机号码
    更改头像
    修改密码

5、登录注册
    注册越简单越好，一个手机号，一个验证码即可，再设置一个密码即可，或者也可以不用密码，直接验证码登录。
    后面提示用户进行资料完善，比如职业，年龄，性别等，这些都不是必填项。
    如果没有完善物流信息，那么在用户下单的时候需要完善。
    另外还有一个忘记密码功能，通过手机验证码找回。

二、后台主要功能
1、用户管理
    可以对用户的地址，手机，个人基本信息等进行查看、编辑、修改、统计

2、广告管理
    对应用首页banner进行增删改查

3、相册分类管理
    对相册的分类，如毕业季、旅行等分类进行增删改查

4、相册模板管理
    对模板增删改查和推送客户端
    对用户上传的模板进行审核，归类

5、广场管理
    对用户的广场内容进行审核管理，可以置顶，可以隐藏等
    对广场的互动内容进行管理
    对用户的好友信息进行管理

6、消息管理
    对消息增删改查，分为系统消息，推广消息，有推送

7、订单管理
    对成单、未成单的都有管理，支付，未支付

8、优惠券管理


三、Api
1、注册接口
2、登录接口
3、banner接口
4、相册分类接口
5、相册模板接口
6、广场列表接口
7、评论接口
8、互粉接口
9、相册制作上传接口
10、支付创建接口
11、支付客户端回调接口
12、支付服务端回调接口
13、用户信息接口
14、头像更改接口
15、手机换绑接口
16、用户相册列表接口
17、用户订单列表接口
18、用户相册详情接口
19、用户订单详情接口
20、用户更新个人信息接口
21、模板更新下载接口
22、优惠券接口
23、短信接口


四、微信端
公众号？还是webmobile？
其实就是一个webmobile
